## Plan Result (demo-global)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-idam-web-public"
          + load_balancing_name = "loadBalancingSettings-idam-web-public"
          + name                = "idam-web-public"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "idam-web-public.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-idam-web-admin"
          + load_balancing_name = "loadBalancingSettings-idam-web-admin"
          + name                = "idam-web-admin"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "idam-web-admin.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-idam-web-public"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-idam-web-admin"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-idam-web-public"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-idam-web-admin"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web.demo.platform.hmcts.net" -> "idam-web-public.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web"
          ~ name                                    = "wwwpaymentoutcome-web" -> "idam-web-public"
          + web_application_firewall_policy_link_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web-int.demo.platform.hmcts.net" -> "idam-web-admin.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web-int"
          ~ name                                    = "wwwpaymentoutcome-web-int" -> "idam-web-admin"
          + web_application_firewall_policy_link_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web-int.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web-int"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "reformscan",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "idam-web-public"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "idam-web-public"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "idam-web-admin"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "idam-web-admin"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum-public",
              + "reformscan",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/plum-publicHttpsRedirect"
          ~ name               = "plum-publicHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dss-update-case",
              + "plum-public",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/dss-update-caseHttpsRedirect"
          ~ name               = "dss-update-caseHttpsRedirect" -> "plum-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "plum",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "plumHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-dn",
              + "dss-update-case",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/div-dnHttpsRedirect"
          ~ name               = "div-dnHttpsRedirect" -> "dss-update-caseHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-da",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/div-daHttpsRedirect"
          ~ name               = "div-daHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-rfe",
              + "div-dn",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/div-rfeHttpsRedirect"
          ~ name               = "div-rfeHttpsRedirect" -> "div-dnHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-pfe",
              + "div-da",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/div-pfeHttpsRedirect"
          ~ name               = "div-pfeHttpsRedirect" -> "div-daHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact",
              + "div-rfe",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/factHttpsRedirect"
          ~ name               = "factHttpsRedirect" -> "div-rfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-admin",
              + "div-pfe",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fact-adminHttpsRedirect"
          ~ name               = "fact-adminHttpsRedirect" -> "div-pfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "fact",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "fact-admin",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble-int",
              + "et-sya",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paybubble-intHttpsRedirect"
          ~ name               = "paybubble-intHttpsRedirect" -> "et-syaHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "paybubble",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web-int",
              + "paybubble-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-web-intHttpsRedirect"
          ~ name               = "paymentoutcome-web-intHttpsRedirect" -> "paybubble-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "paymentoutcome-web",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "paymentoutcome-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register-int",
              + "paymentoutcome-web-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fees-register-intHttpsRedirect"
          ~ name               = "fees-register-intHttpsRedirect" -> "paymentoutcome-web-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-web",
              + "fees-register",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fis-ds-webHttpsRedirect"
          ~ name               = "fis-ds-webHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "fees-register-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "fees-register-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "fis-ds-web",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "fis-ds-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau-int",
              + "ia-aip",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/lau-intHttpsRedirect"
          ~ name               = "lau-intHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cmc",
              + "lau",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/cmcHttpsRedirect"
          ~ name               = "cmcHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv",
              + "lau-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/nfdivHttpsRedirect"
          ~ name               = "nfdivHttpsRedirect" -> "lau-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "cmc",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "cmcHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq-int",
              + "nfdiv",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/pcq-intHttpsRedirect"
          ~ name               = "pcq-intHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "pcq",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "pcq-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "pcq-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "rpts",
              + "privatelaw",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/rptsHttpsRedirect"
          ~ name               = "rptsHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "civil-citizen-ui",
              + "probate",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/civil-citizen-uiHttpsRedirect"
          ~ name               = "civil-citizen-uiHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "rpts",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "rptsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar-int",
              + "civil-citizen-ui",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/bar-intHttpsRedirect"
          ~ name               = "bar-intHttpsRedirect" -> "civil-citizen-uiHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ac-int-gateway-ccd",
              + "bar",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/ac-int-gateway-ccdHttpsRedirect"
          ~ name               = "ac-int-gateway-ccdHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "bar-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "bar-intHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sptribs-frontend",
              + "ac-int-gateway-ccd",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/sptribs-frontendHttpsRedirect"
          ~ name               = "sptribs-frontendHttpsRedirect" -> "ac-int-gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-cor",
              + "adoption-web",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/sscs-corHttpsRedirect"
          ~ name               = "sscs-corHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-tribunals",
              + "sptribs-frontend",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/sscs-tribunalsHttpsRedirect"
          ~ name               = "sscs-tribunalsHttpsRedirect" -> "sptribs-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmcts-access",
              + "sscs-cor",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/hmcts-accessHttpsRedirect"
          ~ name               = "hmcts-accessHttpsRedirect" -> "sscs-corHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "sscs-tribunals",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "sscs-tribunalsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-approve-org-int",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/xui-approve-org-intHttpsRedirect"
          ~ name               = "xui-approve-org-intHttpsRedirect" -> "hmcts-accessHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-manage-org-int",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/xui-manage-org-intHttpsRedirect"
          ~ name               = "xui-manage-org-intHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "xui-approve-org-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "xui-approve-org-intHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.demo.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web-int",
              + "xui-manage-org-int",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-web-intwwwRedirect"
          ~ name               = "paymentoutcome-web-intwwwRedirect" -> "xui-manage-org-intHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web-int.demo.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "idam-web-public",
            ]
          + name               = "idam-web-publicHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "idam-web-admin",
            ]
          + name               = "idam-web-adminHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.demo.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web-int",
            ]
          + name               = "paymentoutcome-web-intwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web-int.demo.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (217 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["idam-web-admin"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/idam-web-admin"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["idam-web-public"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/idam-web-public"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-admin"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "idamwebadmindemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "activationRedirectUrl"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "activationRedirectUrl"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.AuthId"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.Session"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "jwt"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "label"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "oauth2ClientId"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "oauth2ClientSecret"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "oauth2RedirectUris"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "oauth2RedirectUris"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "password"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirectUri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "idamwebpublicdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "client_id"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "client_id"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "scope"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_preferences_set"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "seen_cookie_message"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.AuthId"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.Session"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "jwt"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "label"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "oauth2ClientSecret"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "password"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "username"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "email"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "redirectUri"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirectUri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "referer"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "response_type"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "scope"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "state"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.SSOSession"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "session_state"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "nonce"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "post_logout_redirect_uri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "id_token_hint"
            }
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1500,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->